Repository: lua-fr/manual
Catalog: *.partial/001-part1.po
Languages: fr_fr

source: When you use @Lid{xpcall} or @Lid{lua_pcall}, you may give a @def{message handler} to be called in case of errors. This function is called with the original error object and returns a new error object. It is called before the error unwinds the stack, so that it can gather more information about the error, for instance by inspecting the stack and creating a stack traceback. This message handler is still protected by the protected call; so, an error inside the message handler will call the message handler again. If this loop goes on for too long, Lua breaks it and returns an appropriate message. (The message handler is called only for regular runtime errors. It is not called for memory-allocation errors nor for errors while running finalizers.)
fr_fr: Lorsque vous utilisez @Lid{xpcall} ou @Lid{lua_pcall}, vous pouvez passer un @def{gestionnaire de message} à appeler en cas d'erreurs. Cette fonction est appelée avec l'objet d'erreur d'origine et renvoie un nouvel objet d'erreur. Il est appelé avant que l'erreur déroule la pile, afin qu'il puisse recueillir plus d'informations sur l'erreur, par exemple en inspectant la pile et en créant une trace de la pile. Ce gestionnaire de message est toujours protégé par un appel protégé; donc, une erreur dans le gestionnaire de messages appellera à nouveau le gestionnaire de messages. Si cette boucle dure trop longtemps, Lua le casse et renvoie un message approprié. (Le gestionnaire de messages est uniquement appelé pour des erreurs d'exécution régulières. Il n'est pas appelé ni pour des erreurs d'allocation mémoire ni pour des erreurs de finalisations d'exécution.)

source: @sect2{metatable| @title{Metatables and Metamethods}
fr_fr: @sect2{metatable| @title{Metatbles et Metamethods}

source: Every value in Lua can have a @emph{metatable}. This @def{metatable} is an ordinary Lua table that defines the behavior of the original value under certain special operations. You can change several aspects of the behavior of operations over a value by setting specific fields in its metatable. For instance, when a non-numeric value is the operand of an addition, Lua checks for a function in the field @St{__add} of the value's metatable. If it finds one, Lua calls this function to perform the addition.
fr_fr: Toute valeur en Lua peut avoir une @empth{metatable}. Cette @emph{metatable} est une table Lua ordinaire qui définit le comportement de la valeur d'origine sous certaines opérations spéciales. Vous pouvez modifier plusieurs aspects du comportement des opérations sur une valeur en définissant des champs spécifiques dans sa metatable. Par exemple, lorsqu'une valeur non numérique est l'opérande d'une addition, Lua regarde si le champ de @St{__add} de la metatable de la valeur a pour valeur associée une fonction. S'il en trouve un, Lua appelle cette fonction pour effectuer l'addition.

source: The key for each event in a metatable is a string with the event name prefixed by two underscores; the corresponding values are called @def{metamethods}. In the previous example, the key is @St{__add} and the metamethod is the function that performs the addition.
fr_fr: La clé pour chaque événement dans une metatable est une chaîne avec le nom de l'événement préfixé par deux caractères de soulignement; les valeurs correspondantes sont appelées @def{metamethods}. Dans l'exemple précédent, la clé est @St{__add} et la metamethod est la fonction qui effectue l'addition.

source: You can query the metatable of any value using the @Lid{getmetatable} function. Lua queries metamethods in metatables using a raw access @seeF{rawget}. So, to retrieve the metamethod for event @id{ev} in object @id{o}, Lua does the equivalent to the following code: @verbatim{ rawget(getmetatable(@rep{o}) or {}, "__@rep{ev}") }
fr_fr: Vous pouvez obtenir la metatable de n'importe quelle valeur en utilisant la fonction @Lid{getmetatable}. Lua interroge les metamethods dans les metatables en utilisant un accès brut @seeF{rawget}. Donc, pour récupérer la metamethod pour l'événement @id{ev} dans l'objet @id{o}, Lua fait l'équivalent du coude suivant: @verbatim{ rawget(getmetatable(@rep{o}) or {}, "__@rep{ev}") }

source: You can replace the metatable of tables using the @Lid{setmetatable} function. You cannot change the metatable of other types from Lua code (except by using the @link{debuglib|debug library}); you should use the @N{C API} for that.
fr_fr: Vous pouvez remplacer les metatables de tables en utilisant la fonction @Lid{setmetatable}. Vous ne pouvez pas modifier les metatables d'autres types depuis du code Lua (sauf en utilisant @link{debuglib|debug library}); vous devrez utiliser @N{l'API C} pour cela.

source: Tables and full userdata have individual metatables (although multiple tables and userdata can share their metatables). Values of all other types share one single metatable per type; that is, there is one single metatable for all numbers, one for all strings, etc. By default, a value has no metatable, but the string library sets a metatable for the string type @see{strlib}.
fr_fr: Les tables et les full userdata ont chacun leur propre metatable (plusieurs tables ou userdata peuvent cependant partager une même metatable). Les valeurs des autres types partagent la même metatable par type; il y a une table pour tous les numbers, une pour toutes les strings etc. Par défaut, une valeur n'a pas de metatable définie, cependant la bibliothèque string définit une metatable pour le type string @see{strlib}.

source: A metatable controls how an object behaves in arithmetic operations, bitwise operations, order comparisons, concatenation, length operation, calls, and indexing. A metatable also can define a function to be called when a userdata or a table is @link{GC|garbage collected}.
fr_fr: Une metatable contrôle comment se comporte un objet dans les opérations arithmétiques, les opérations bit à bit, les comparaisons, les concaténations, les appels, l'indexation et les opérations de longueur. Elle peut également définir une fonction appelé quand une userdata ou une table passe au @link{GC|garbage collector}.

source: For the unary operators (negation, length, and bitwise NOT), the metamethod is computed and called with a dummy second operand, equal to the first one. This extra operand is only to simplify Lua's internals (by making these operators behave like a binary operation) and may be removed in future versions. (For most uses this extra operand is irrelevant.)
fr_fr: Dans le cas des opérateurs unaires (négation, longueur, non bit à bit), la metamethod est appelé avec un second argument factice égal au premier. Cet argument supplémentaire est uniquement présent pour simplifier l'implémentation de Lua (en confondant les opérateurs unaires et binaires) et peut disparaître dans de prochaine version de Lua. (Dans la plupart des cas, cet argument n'a pas d'utilité.)

source: A detailed list of events controlled by metatables is given next. Each operation is identified by its corresponding key.
fr_fr: Voici une liste détaillée des éventements contrôlés par les metatables. Chaque opération est identifiée par sa clé correspondante.

source: @item{@idx{__add}| the addition (@T{+}) operation. If any operand for an addition is not a number (nor a string coercible to a number), Lua will try to call a metamethod. First, Lua will check the first operand (even if it is valid). If that operand does not define a metamethod for @idx{__add}, then Lua will check the second operand. If Lua can find a metamethod, it calls the metamethod with the two operands as arguments, and the result of the call (adjusted to one value) is the result of the operation. Otherwise, it raises an error. }
fr_fr: @item{@idx{__add}| Opération d'addition(@T{+}). Si un opérande pour une addition n'est pas un nombre (ni une chaîne assimilable à un nombre), Lua essaiera d'appeler une metamethod. Tout d'abord, Lua vérifie le première opérande (même s'il est valide). Si cet opérande ne définit pas une metamethod pour @idx{__add}, alors Lua vérifie le second opérande. Si Lua peut trouver une metamethod, il appelle la metamethod avec les deux opérandes comme arguments et le résultat de l'appel (ajusté à une valeur) est le résultat de l'opération. Autrement, cela soulève une erreur. }

source: @item{@idx{__sub}| the subtraction (@T{-}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__sub}| Opération de soustraction (@T{-}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__mul}| the multiplication (@T{*}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__mul}| Opération de multiplication (@T{*}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__div}| the division (@T{/}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__div}| Opération de devision (@T{/}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__mod}| the modulo (@T{%}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__mod}| Opération modulo (@T{%}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__pow}| the exponentiation (@T{^}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__pow}| Opération d'exponentiation (@T{^}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__unm}| the negation (unary @T{-}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__unm}| Opération négation (unary @T{-}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__idiv}| the floor division (@T{//}) operation. Behavior similar to the addition operation. }
fr_fr: @item{@idx{__idiv}| Opération floor (@T{//}). Comportement similaire à l'opération d'addition. }

source: @item{@idx{__band}| the bitwise AND (@T{&}) operation. Behavior similar to the addition operation, except that Lua will try a metamethod if any operand is neither an integer nor a value coercible to an integer @see{coercion}. }
fr_fr: @item{@idx{__band}| Opération AND (@T{&}) bit à bit. Comportement semblable à l'opération d'addition, sauf que Lua va essayer une metamethod si un opérande n'est ni un nombre entier ni une valeur assimilable à un entier @see{coercion}. }

source: @item{@idx{__bor}| the bitwise OR (@T{|}) operation. Behavior similar to the bitwise AND operation. }
fr_fr: @item{@idx{__bor}| Opération OR (@T{|} bit à bit. Comportement semblable à l'opération AND bit à bit. }

source: @item{@idx{__bxor}| the bitwise exclusive OR (binary @T{~}) operation. Behavior similar to the bitwise AND operation. }
fr_fr: @item{@idx{__ bxor}| Opération OU (binaire @T{~}) externe bit à bit. Comportement semblable à l'opération AND bit à bit. }

source: @item{@idx{__bnot}| the bitwise NOT (unary @T{~}) operation. Behavior similar to the bitwise AND operation. }
fr_fr: @item{@idx{__bnot}| Opération NOT (unaire @T{~}) bit à bit. Comportement semblable à l'opération AND bit à bit. }

source: @item{@idx{__shl}| the bitwise left shift (@T{<<}) operation. Behavior similar to the bitwise AND operation. }
fr_fr: @item{@idx{__shl}| Opération de décalage vers la gauche (@T{<<}). Comportement semblable à l'opération AND bit à bit. }

source: @item{@idx{__shr}| the bitwise right shift (@T{>>}) operation. Behavior similar to the bitwise AND operation. }
fr_fr: @item{@idx{__shr}| Opération de décalage à droite (@T{>>}). Comportement semblable à l'opération AND bit à bit. }

source: @item{@idx{__concat}| the concatenation (@T{..}) operation. Behavior similar to the addition operation, except that Lua will try a metamethod if any operand is neither a string nor a number (which is always coercible to a string). }
fr_fr: @item{@idx{__concat}| Opération de concaténation (@T{..}). Comportement semblable à l'opération d'addition, sauf que Lua va essayer une metamethod si un opérande n'est ni une chaîne ni un numéro (qui est toujours coercible à une chaîne). }

source: @item{@idx{__len}| the length (@T{#}) operation. If the object is not a string, Lua will try its metamethod. If there is a metamethod, Lua calls it with the object as argument, and the result of the call (always adjusted to one value) is the result of the operation. If there is no metamethod but the object is a table, then Lua uses the table length operation @see{len-op}. Otherwise, Lua raises an error. }
fr_fr: @item{@idx{__len}| Opération de longueur (@T{#}). Si l'objet n'est pas une chaîne, Lua va essayer sa metamethod. S'il y a une metamethod, Lua l'appelle avec l'objet comme argument, et le résultat de l'appel (toujours ajusté à une valeur) est le résultat de l'opération. S'il n'y a pas de metamethod mais que l'objet est une table, alors Lua utilise l'opération de longueur de table @see{len-op}. Sinon, Lua soulève une erreur. }

source: @item{@idx{__eq}| the equal (@T{==}) operation. Behavior similar to the addition operation, except that Lua will try a metamethod only when the values being compared are either both tables or both full userdata and they are not primitively equal. The result of the call is always converted to a boolean. }
fr_fr: @item{@idx{__eq}| Opération égale (@T{==}). Comportement semblable à l'opération d'addition, sauf que Lua essaiera une metamethod uniquement lorsque les valeurs en comparaison sont soit deux table, soit deux userdata et s'ils ne sont pas primordialement égaux. Le résultat de l'appel est toujours converti en booléen. }

source: @item{@idx{__lt}| the less than (@T{<}) operation. Behavior similar to the addition operation, except that Lua will try a metamethod only when the values being compared are neither both numbers nor both strings. The result of the call is always converted to a boolean. }
fr_fr: @item{@idx{__lt}| Opération moins (@T{<}). Comportement semblable à l'opération d'addition, sauf que Lua essaiera une metamethod uniquement lorsque les valeurs en comparaison ne sont ni les mêmes, ni deux chaînes. Le résultat de l'appel est toujours converti en booléen. }

source: @item{@idx{__le}| the less equal (@T{<=}) operation. Unlike other operations, the less-equal operation can use two different events. First, Lua looks for the @idx{__le} metamethod in both operands, like in the less than operation. If it cannot find such a metamethod, then it will try the @idx{__lt} metamethod, assuming that @T{a <= b} is equivalent to @T{not (b < a)}. As with the other comparison operators, the result is always a boolean. (This use of the @idx{__lt} event can be removed in future versions; it is also slower than a real @idx{__le} metamethod.) }
fr_fr: @item{@idx{__le}| L'opération inférieur ou égal (@T{<=}) operation. Contrairement aux autres opérations, l'opération inférieur ou égal peut utiliser deux évenements différents. Premièrement, Lua cherche la métaméthode @idx{__le} dans les deux operandes, comme dans l'opération strictement inférieur. Si il ne peut pas trouver cette métaméthode, alors il va essayer la métaméthode @idx{__lt}, en supposant que @T{a <= b} est équivalent à @T{not (b < a)}. Comme les autres opérateurs de comparaison, le résultat est toujours un booléen. (Cette utilisation de l'évenement @idx{__lt} peut être supprimée dans des versions futures; elle est aussi plus lente qu'une vraie métaméthode @idx{__le}.) }

source: @item{@idx{__index}| The indexing access @T{table[key]}. This event happens when @id{table} is not a table or when @id{key} is not present in @id{table}. The metamethod is looked up in @id{table}.
fr_fr: @item{@idx{__index}| L'accès par clé @T{table[key]}. Cet événement arrive quand @id{table} n'est pas une table ou quand @id{key} n'est pas présent dans @id{table}. Cette métaméthode est recherchée dans @id{table}.

source: Despite the name, the metamethod for this event can be either a function or a table. If it is a function, it is called with @id{table} and @id{key} as arguments, and the result of the call (adjusted to one value) is the result of the operation. If it is a table, the final result is the result of indexing this table with @id{key}. (This indexing is regular, not raw, and therefore can trigger another metamethod.) }
fr_fr: Malgré son nom, la métaméthode pour cet événement peut être soit une fonction ou une table. Si c'est une fonction, elle est appellée avec @id{table} et @id{key} comme arguments, et le résultat de l'appel (ajusté à une seule valeur) est le résultat de l'opération. Si c'est une table, le résultat final est le résultat de l'indexation de cette table avec @id{key}. (Cet indexation est régulière, pas brute, et peut donc déclencher une autre métamethode.) }

source: @item{@idx{__newindex}| The indexing assignment @T{table[key] = value}. Like the index event, this event happens when @id{table} is not a table or when @id{key} is not present in @id{table}. The metamethod is looked up in @id{table}.
fr_fr: @item{@idx{__newindex}| L'affectation par indexation @T{table[key] = value}. Comme l’événement d'indexation, cet événement arrive quand @id{table} n'est pas une table ou quand @id{key} n'est pas présent dans @id{table}.

source: Like with indexing, the metamethod for this event can be either a function or a table. If it is a function, it is called with @id{table}, @id{key}, and @id{value} as arguments. If it is a table, Lua does an indexing assignment to this table with the same key and value. (This assignment is regular, not raw, and therefore can trigger another metamethod.)
fr_fr: Comme l'indexation, la métamethode pour cet évenement peut être soit une fonction, soit une table. Si c'est une fonction, elle est appellée avec @id{table}, @id{key}, et @id{value} comme arguments. Si c'est une table, Lua fait une affectation par indexation à cette table avec la même clé et valeur. (Cet affectation est régulier, pas brute, et peut donc déclencher une autre métamethode.)

source: @item{@idx{__call}| The call operation @T{func(args)}. This event happens when Lua tries to call a non-function value (that is, @id{func} is not a function). The metamethod is looked up in @id{func}. If present, the metamethod is called with @id{func} as its first argument, followed by the arguments of the original call (@id{args}). All results of the call are the result of the operation. (This is the only metamethod that allows multiple results.) }
fr_fr: @item{@idx{__call}| L'opération d'appel @T{func(args)}. Cet évenement arrive quand Lua essaye d'appeler une valeur qui n'est pas une fonction (c'est à dire, @id{func} n'est pas une fonction). La métaméthode est cherchée dans @id{func}. Si présente, la métaméthode est appelée avec @id{func} en tant que premier argument, suivi par les arguments de l'appel original (@id{args}). Tous les résultats de l'appel sont le résultat de l'opération. (C'est la seule métaméthode qui permet plusieurs résultats.) }

source: It is a good practice to add all needed metamethods to a table before setting it as a metatable of some object. In particular, the @idx{__gc} metamethod works only when this order is followed @see{finalizers}.
fr_fr: C'est une bonne pratique d'ajouter toutes les metamethod nécessaires à une table avant de la configurer comme une metatable d'un objet quelconque. En particulier, la metamethod @idx{__gc} fonctionne uniquement dans ce cas @see{finalizers}

source: Because metatables are regular tables, they can contain arbitrary fields, not only the event names defined above. Some functions in the standard library (e.g., @Lid{tostring}) use other fields in metatables for their own purposes.
fr_fr: Comme les metatables sont des tableaux réguliers, ils peuvent contenir des champs arbitraires en plus des noms d'événements définis ci-dessus. Certaines fonctions de la bibliothèque standard (e.g., @Lid{tostring}) utilises d'autres champs de la metatable pour leur propre fonctionnement.

source: Lua performs automatic memory management. This means that you do not have to worry about allocating memory for new objects or freeing it when the objects are no longer needed. Lua manages memory automatically by running a @def{garbage collector} to collect all @emph{dead objects} (that is, objects that are no longer accessible from Lua). All memory used by Lua is subject to automatic management: strings, tables, userdata, functions, threads, internal structures, etc.
fr_fr: Lua effectue une gestion automatique de la mémoire. Ceci veut dire que vous n'avez pas à vous soucier d'allouer de la mémoire pour les nouveaux objets ou de la libérer lorsque les objets ne sont plus nécessaires. Lua gère automatiquement la mémoire en exécutant un @def{garbage collector} pour collecter tous les @emph{objets morts} (c'est à dire les objets qui ne sont plus accessible depuis Lua). L'intégralité de la mémoire utilisée par Lua est soumise à une gestion automatique : chaînes, tables, userdata, fonctions, threads, structures internes, etc.

source: Lua implements an incremental mark-and-sweep collector. It uses two numbers to control its garbage-collection cycles: the @def{garbage-collector pause} and the @def{garbage-collector step multiplier}. Both use percentage points as units (e.g., a value of 100 means an internal value of 1).
fr_fr: Lua met en œuvre un collecteur incrémental de mark-and-sweep. Il utilise deux nombres pour contrôler ses cycles de garbage-collection: le @def{garbage-corrector pause} et le @def{garbage-collector step multiplier}. Les deux utilisent des points de pourcentage comme des unités (par exemple, une valeur de 100 signifie une valeur interne de 1).

source: The garbage-collector pause controls how long the collector waits before starting a new cycle. Larger values make the collector less aggressive. Values smaller than 100 mean the collector will not wait to start a new cycle. A value of 200 means that the collector waits for the total memory in use to double before starting a new cycle.
fr_fr: Le garbage-collector pause contrôle la durée pendant laquelle le collecteur attend avant de commencer un nouveau cycle. Des valeurs plus importantes rendent le collecteur moins agressif. Les valeurs inférieures à 100 signifient que le collecteur n'attendra pas pour démarrer un nouveau cycle. Une valeur de 200 signifie que le collecteur attend que le double de la mémoire total soit utilisé avant de commencer un nouveau cycle.

source: The garbage-collector step multiplier controls the relative speed of the collector relative to memory allocation. Larger values make the collector more aggressive but also increase the size of each incremental step. You should not use values smaller than 100, because they make the collector too slow and can result in the collector never finishing a cycle. The default is 200, which means that the collector runs at @Q{twice} the speed of memory allocation.
fr_fr: Le garbage-collector step multiplier contrôle la vitesse relative du collecteur par rapport à l'allocation mémoire. Des valeurs plus importantes rendent le collecteur plus agressif mais aussi, augmentent la charge de chaque étape. Vous ne devez pas utiliser des valeurs inférieures à 100, parce qu'elles rendent le collecteur trop lent et il est probable que le collecteur ne termine jamais un cycle. La valeur par défaut est de 200, ce qui signifie que le collecteur fonctionne à @Q{deux fois} la vitesse d'allocation de la mémoire.
