Repository: lua-fr/manual
Catalog: *.partial/001-part1.po
Languages: fr_fr

source: If you set the step multiplier to a very large number (larger than 10% of the maximum number of bytes that the program may use), the collector behaves like a stop-the-world collector. If you then set the pause to 200, the collector behaves as in old Lua versions, doing a complete collection every time Lua doubles its memory usage.
fr_fr: Si vous définissez le multiplicateur de pas à un très grand nombre (plus de 10% du nombre maximum d'octets que le programme peut utiliser), le collecteur se comporte comme un collecteur de stop-the-world (c'est à dire qu'un pas réalise un cycle complet). Si vous réglez la pause sur 200, le collecteur se comporte comme dans les anciennes versions de Lua, faire une collection complète chaque fois que Lua double son utilisation mémoire

source: You can change these numbers by calling @Lid{lua_gc} in C or @Lid{collectgarbage} in Lua. You can also use these functions to control the collector directly (e.g., stop and restart it).
fr_fr: Vous pouvez modifier ces nombres en appelant @Lid{lua_gc} en C ou @Lid{collectgarbage} en Lua. Vous pouvez également utiliser ces fonctions pour contrôler directement le collecteur (par exemple, pour l'arrêter et le redémarrer).
