Repository: lua-fr/manual
Catalog: *.partial/001-part1.po
Languages: fr_fr

source: Lua is a powerful, efficient, lightweight, embeddable scripting language. It supports procedural programming, object-oriented programming, functional programming, data-driven programming, and data description.
fr_fr: Lua est un langage de script puissant, efficace, léger, embarquable. Il supporte la programmation procédurale, la programmation orientée objet, la programmation fonctionnelle, la programmation data-driven et la description de données.

source: Lua combines simple procedural syntax with powerful data description constructs based on associative arrays and extensible semantics. Lua is dynamically typed, runs by interpreting bytecode with a register-based virtual machine, and has automatic memory management with incremental garbage collection, making it ideal for configuration, scripting, and rapid prototyping.
fr_fr: Lua combine une syntaxe procédurale simple avec une puissante construction de description des données basée sur des tableaux associatifs et une sémantique extensible. Lua est typée dynamiquement, basée sur l'interprétation d'un bytecode et une machine virtuelle. Il possède une gestion de la mémoire avec un garbage collector incrémental, le rendant facilement configurable, scriptable, et un prototypage rapide.

source: Lua is implemented as a library, written in @emphx{clean C}, the common subset of @N{Standard C} and C++. The Lua distribution includes a host program called @id{lua}, which uses the Lua library to offer a complete, standalone Lua interpreter, for interactive or batch use. Lua is intended to be used both as a powerful, lightweight, embeddable scripting language for any program that needs one, and as a powerful but lightweight and efficient stand-alone language.
fr_fr: Lua est implémenté comme une bibliothèque, écrite en @emphx{clean C}, le sous-ensemble issue du @N{Standard C} et C++. La distribution du Lua comprend un programme hôte nommé @id{lua}, qui utilise la librairie Lua pour offrir un interpréteur Lua complet, et autonome, à utiliser interactivement ou comme interpréteur. Lua est pensé pour être un langage scriptable à la fois puissant, léger, et embarquable pour les besoins de tous les programmes, et un langage autonome puissant, léger, et efficace.

source: As an extension language, Lua has no notion of a @Q{main} program: it works @emph{embedded} in a host client, called the @emph{embedding program} or simply the @emphx{host}. (Frequently, this host is the stand-alone @id{lua} program.) The host program can invoke functions to execute a piece of Lua code, can write and read Lua variables, and can register @N{C functions} to be called by Lua code. Through the use of @N{C functions}, Lua can be augmented to cope with a wide range of different domains, thus creating customized programming languages sharing a syntactical framework.
fr_fr: En tant que langage d'extension, Lua n'a pas de fonction principale @Q{main} : il fonctionne comme un langage embarqué sur un hôte, appelé @emph{programme embarqué}, ou simplement @emphx{hôte}. (Souvent, cet hôte est un programme @id{lua} autonome.) Le programme hôte peut appeler des fonctions pour exécuter des morceaux de code Lua, peut écrire et lire des variables Lua, peut enregistrer des @N{fonctions C} pour être appelées avec du code Lua. Avec l'utilisation de @N{fonctions C}, Lua peut être utilisé dans de nombreux domaines de programmation, et ainsi créer des langages de programmation partageant une même base syntaxique.

source: Lua is free software, and is provided as usual with no guarantees, as stated in its license. The implementation described in this manual is available at Lua's official web site, @id{www.lua.org}.
fr_fr: Lua est un logiciel libre, et est fourni sans aucune garantie, comme indiqué dans sa licence. L'implémentation décrite dans ce manuel est disponible sur le site officiel de Lua, @id{www.lua.org}.

source: Like any other reference manual, this document is dry in places. For a discussion of the decisions behind the design of Lua, see the technical papers available at Lua's web site. For a detailed introduction to programming in Lua, see Roberto's book, @emphx{Programming in Lua}.
fr_fr: Comme n'importe quel autre manuel de référence, ce document n'a pas pour but d'enseigner, mais de renseigner. Pour discuter des décisions à propos du design de Lua, voir les documents techniques disponibles sur le site de Lua. Pour une introduction technique à la programmation en Lua, voir le livre de Roberto, @emphx{Programming in Lua}.

source: @C{-------------------------------------------------------------------------} @sect1{basic| @title{Basic Concepts}
fr_fr: @C{-------------------------------------------------------------------------} @sect1{basic| @title{Concepts de base}

source: This section describes the basic concepts of the language.
fr_fr: Cette section décrit les concepts de base du langage.

source: @sect2{TypesSec| @title{Values and Types}
fr_fr: @sect2{TypesSec| @title{Valeurs et types}

source: Lua is a @emph{dynamically typed language}. This means that variables do not have types; only values do. There are no type definitions in the language. All values carry their own type.
fr_fr: Lua est un @emph{langage typé dynamiquement}. Cela signifie que les variables n'ont pas de type, seules les valeurs en ont un. Il n'y a pas de définition de type dans le langage. Toutes les valeurs portent leur propre type.

source: All values in Lua are @emph{first-class values}. This means that all values can be stored in variables, passed as arguments to other functions, and returned as results.
fr_fr: Toutes les valeurs dans Lua sont @emph{des valeurs de première classe}. Cela signifie que toutes les valeurs sont stockées dans des variables, passées comme arguments à des fonctions, et renvoyées comme résultat.

source: There are eight @x{basic types} in Lua: @def{nil}, @def{boolean}, @def{number}, @def{string}, @def{function}, @def{userdata}, @def{thread}, and @def{table}. The type @emph{nil} has one single value, @nil, whose main property is to be different from any other value; it usually represents the absence of a useful value. The type @emph{boolean} has two values, @false and @true. Both @nil and @false make a condition false; any other value makes it true. The type @emph{number} represents both integer numbers and real (floating-point) numbers. The type @emph{string} represents immutable sequences of bytes. @index{eight-bit clean} Lua is 8-bit clean: strings can contain any 8-bit value, including @x{embedded zeros} (@Char{\0}). Lua is also encoding-agnostic; it makes no assumptions about the contents of a string.
fr_fr: Il y a huit @x{types de base} en Lua : @def{nil}, @def{boolean}, @def{number}, @def{string}, @def{function}, @def{userdata}, @def{thread}, et @def{table}. Le type @emph{nil} ne contient qu'une valeur, @nil, qui a la principale propriété d'être différente de toutes les autres valeurs ; il représente usuellement l'absence de valeur utile. Le type @emph{boolean} contient deux valeurs, @false et @true. @nil et @false sont des conditions fausses ; toutes les autres valeurs sont des conditions vraies. Le type @emph{number} représente à la fois les nombres entiers, et réels. Le type @emph{string} représente des séquences d'octets immuables. @index{eight-bin clean} Lua est 8-bit clean : Les strings peuvent contenir n'importes quelles valeurs de 8 bits, incluant les @x{embedded zeros} (@Char{\0}). Lua est aussi indépendant de l'encodage ; il ne suppose rien sur le contenu d'un string.

source: The type @emph{number} uses two internal representations, or two @x{subtypes}, one called @def{integer} and the other called @def{float}. Lua has explicit rules about when each representation is used, but it also converts between them automatically as needed @see{coercion}. Therefore, the programmer may choose to mostly ignore the difference between integers and floats or to assume complete control over the representation of each number. Standard Lua uses 64-bit integers and double-precision (64-bit) floats, but you can also compile Lua so that it uses 32-bit integers and/or single-precision (32-bit) floats. The option with 32 bits for both integers and floats is particularly attractive for small machines and embedded systems. (See macro @id{LUA_32BITS} in file @id{luaconf.h}.)
fr_fr: Le type @emph{number} utilise deux représentations internes, ou deux @x{subtypes}, une appelée @def{integer}, et une autre appelée @def{float}. Lua a des règles explicites quant à la représentation à utiliser, mais peut également les convertir automatiquement quand cela est nécessaire @see{coercion}. Par conséquent, le programmeur peut choisir d'ignorer la différence entre les integers et les floats la plupart du temps, ou bien contrôler complètement quel type utiliser. Le Lua standard utilise des integers sur 64 bits, et des floats à double précision (64 bits), mais vous pouvez aussi compiler Lua pour le faire utiliser des integers sur 32 bits et/ou des floats à simple précision (32 bits). Le fait d'utiliser 32 bits pour et les integers, et les floats est particulièrement avantageux pour les petites machines, et les machines embarquées (voir la macro @id{LUA_32BITS} dans le fichier @id{luaconf.h}).

source: Lua can call (and manipulate) functions written in Lua and functions written in C @see{functioncall}. Both are represented by the type @emph{function}.
fr_fr: Lua peut appeler (et manipuler) des fonctions écrites en Lua, et des fonctions écrites en C @see{functioncall}. Les deux sont représentées par le type @emph{function}.

source: The type @emph{userdata} is provided to allow arbitrary @N{C data} to be stored in Lua variables. A userdata value represents a block of raw memory. There are two kinds of userdata: @emphx{full userdata}, which is an object with a block of memory managed by Lua, and @emphx{light userdata}, which is simply a @N{C pointer} value. Userdata has no predefined operations in Lua, except assignment and identity test. By using @emph{metatables}, the programmer can define operations for full userdata values @see{metatable}. Userdata values cannot be created or modified in Lua, only through the @N{C API}. This guarantees the integrity of data owned by the host program.
fr_fr: Le type @emph{userdata} est capable de stocker des @N{C data} dans des variables Lua. Une variable de type userdata représente un bloc mémoire. Il y a deux types d'userdata : @emphx{full userdata}, qui est un objet dont l'emplacement en mémoire est géré par Lua, et @emphx{light userdata}, qui est simplement une valeur de type @N{pointeur C}. Le type userdata n'a pas d'opérations prédéfinies en Lua, en dehors de l'affectation et des tests d'identité. En utilisant les @emph{metatables}, le programmeur peut définir des opérations sur les valeurs de type full userdata @see{metatable}. Les valeurs de type userdata ne peuvent pas être créer ou modifier en Lua, mais uniquement en utilisant @N{l'API C}. Cela garantit l'intégrité des données propres au programme hôte.

source: The type @def{thread} represents independent threads of execution and it is used to implement coroutines @see{coroutine}. Lua threads are not related to operating-system threads. Lua supports coroutines on all systems, even those that do not support threads natively.
fr_fr: Le type @def{thread} représente des threads d'exécution indépendants de l'exécution et est utilisé pour implémenter des coroutines @see{coroutine}. Les threads Lua ne sont pas liés aux threads du système d'exploitation. Lua supporte les coroutines sur tous les systèmes, même sur ceux qui ne supportent pas les threads nativement.

source: The type @emph{table} implements @x{associative arrays}, that is, @x{arrays} that can be indexed not only with numbers, but with any Lua value except @nil and @x{NaN}. (@emphx{Not a Number} is a special value used to represent undefined or unrepresentable numerical results, such as @T{0/0}.) Tables can be @emph{heterogeneous}; that is, they can contain values of all types (except @nil). Any key with value @nil is not considered part of the table. Conversely, any key that is not part of a table has an associated value @nil.
fr_fr: Le type @emph{table} implémente les @x{tableaux associatifs} c'est à dire des @x{tableaux} qui peuvent être indexés non seulement avec des nombres, mais avec n'importe quelle valeur Lua exceptés @nil et @x{NaN} (@emphx{Not a Number} est une valeur spéciale utilisée pour représenter des résultats numériques indéfinis ou non représentables, comme par exemple @T{0/0}). Les tables peuvent-être @emph{hétérogènes} ; c'est à dire qu'elles peuvent contenir des valeurs de tous les types (excepté @nil). Les clés de valeur associée @nil ne sont pas considérées comme faisant partie de la table. Réciproquement, toute clé qui ne fait pas partie de la table a pour valeur associée @nil.

source: Tables are the sole data-structuring mechanism in Lua; they can be used to represent ordinary arrays, lists, symbol tables, sets, records, graphs, trees, etc. To represent @x{records}, Lua uses the field name as an index. The language supports this representation by providing @id{a.name} as syntactic sugar for @T{a["name"]}. There are several convenient ways to create tables in Lua @see{tableconstructor}.
fr_fr: Les tables sont le seul mécanismes de structures de données propres à Lua ; elles peuvent être utilisées pour représenter des tableaux ordinaires, des listes, des tables de symboles, des dictionnaires, des enregistrements, des graphes, des arbres, etc. Pour représenter les @x{enregistrements}, Lua utilise le champ de nom comme un index. Le langage supporte cette représentation en fournissant un identifiant @id{a.name} comme sucre syntaxique pour @T{a["name"]}. Il y a plusieurs façons pratiques de créer des tables en Lua @see{tableconstructor}.

source: Like indices, the values of table fields can be of any type. In particular, because functions are first-class values, table fields can contain functions. Thus tables can also carry @emph{methods} @see{func-def}.
fr_fr: Tout comme les indices, les valeurs des champs d'une table peuvent être de tous les types. En particulier, comme les fonctions sont des valeurs de première classe, elles peuvent être des champs d'une table. Ainsi, les tables peuvent contenir des @emph{méthodes} @see{func-def}.

source: The indexing of tables follows the definition of raw equality in the language. The expressions @T{a[i]} and @T{a[j]} denote the same table element if and only if @id{i} and @id{j} are raw equal (that is, equal without metamethods). In particular, floats with integral values are equal to their respective integers (e.g., @T{1.0 == 1}). To avoid ambiguities, any float with integral value used as a key is converted to its respective integer. For instance, if you write @T{a[2.0] = true}, the actual key inserted into the table will be the integer @T{2}. (On the other hand, 2 and @St{2} are different Lua values and therefore denote different table entries.)
fr_fr: L'indexation des tables suit la définition de l'égalité pure dans le langage. Les expressions @T{a[i]} et @T{a[j]} indiquent le même élément de la table si et seulement si @id{i} et @id{j} sont égaux (c'est à dire, égaux sans méta-méthodes). En particulier, les flottants avec des valeurs entières sont égaux à leur représentation entière respective (e.g., @T{1.0 == 1}). Afin d'éviter les ambiguïtés, tous les flottants avec une valeur entière sont automatiquement convertis vers leur forme entière respective. Par exemple, si vous écrivez @T{a[2.0] = true}, la clé insérée dans la table sera l'entier @T{2} (d'un autre côté, 2 et @St{2} sont deux valeurs différentes et pointent ainsi vers deux entrées de la table différentes).

source: Tables, functions, threads, and (full) userdata values are @emph{objects}: variables do not actually @emph{contain} these values, only @emph{references} to them. Assignment, parameter passing, and function returns always manipulate references to such values; these operations do not imply any kind of copy.
fr_fr: Les valeurs de type table, fonction, thread et (full) userdata sont des @emph{objets} : les variables ne @emph{contiennent} pas ces valeurs, elles @{renvoient} vers elles. Les affectations, passages de paramètres, et retours de fonctions manipulent toujours des références vers ces valeurs ; ces opérations n'impliquent pas une quelconque copie.

source: The library function @Lid{type} returns a string describing the type of a given value @see{predefined}.
fr_fr: La fonction de bibliothèque @Lid{type} renvoie une chaîne de caractères décrivant le type de la valeur passé en argument @see{predefined}.

source: @sect2{globalenv| @title{Environments and the Global Environment}
fr_fr: @sect2{globalenv| @title{Environnements et environnement global}

source: As will be discussed in @refsec{variables} and @refsec{assignment}, any reference to a free name (that is, a name not bound to any declaration) @id{var} is syntactically translated to @T{_ENV.var}. Moreover, every chunk is compiled in the scope of an external local variable named @id{_ENV} @see{chunks}, so @id{_ENV} itself is never a free name in a chunk.
fr_fr: Comme nous le verrons dans @refsec{variables} et @refsec{assignment}, chaque référence à un nom libre (c'est à dire, un nom qui n'est pas bound(relié?) à une quelconque déclaration) @id{var} est syntaxiquement transformé en @T{_ENV.var}. De plus, chaque morceau est compilé dans la portée d'une variable locale externe nommée @id{_ENV} @see{chunks}, donc @id{_ENV} lui-même n'est jamais un nom libre dans un morceau.

source: Despite the existence of this external @id{_ENV} variable and the translation of free names, @id{_ENV} is a completely regular name. In particular, you can define new variables and parameters with that name. Each reference to a free name uses the @id{_ENV} that is visible at that point in the program, following the usual visibility rules of Lua @see{visibility}.
fr_fr: Malgré l'existence de cette variable externe @id{_ENV} et la traduction de noms disponible, @id{_ENV} est un nom complètement normal. En particulier, vous pouvez définir de nouvelles variables et paramètres avec ce nom. Chaque référence à un nom disponible utilise le @id{_ENV} qui est visible à ce stade du programme, suivant les règles habituelles de visibilité de Lua @see{visibility}.

source: Any table used as the value of @id{_ENV} is called an @def{environment}.
fr_fr: Toute table utilisée comme valeur de @id{_ENV} s'appelle un @def{environnement}.

source: Lua keeps a distinguished environment called the @def{global environment}. This value is kept at a special index in the C registry @see{registry}. In Lua, the global variable @Lid{_G} is initialized with this same value. (@Lid{_G} is never used internally.)
fr_fr: Lua garde un environnement distinct appelé @def{environnement global}. Cette valeur est conservée dans un index spécial dans un registre C @see{registry}. En Lua, la variable globale @Lid{_G} est initialisée avec cette même valeur. (@Lid{_G} n'est jamais utilisé en interne.)

source: When Lua loads a chunk, the default value for its @id{_ENV} upvalue is the global environment @seeF{load}. Therefore, by default, free names in Lua code refer to entries in the global environment (and, therefore, they are also called @def{global variables}). Moreover, all standard libraries are loaded in the global environment and some functions there operate on that environment. You can use @Lid{load} (or @Lid{loadfile}) to load a chunk with a different environment. (In C, you have to load the chunk and then change the value of its first upvalue.)
fr_fr: Quand Lua charge un morceau, la valeur par défaut pour sa valeur ?????????????????????????????? @id{_ENV} est l'environnement global @seeF{load}. Par conséquent, par défaut, les noms disponibles dans le code Lua se réfèrent aux entrées dans l'environnement global (et, par conséquent, ils sont également appelés @def{variables globales}). En outre, toutes les bibliothèques standard sont chargées dans l'environnement global et certaines fonctions fonctionnent dans cet environnement. (En C, vous devez charger le morceau puis modifier la valeur de sa première ??????.)

source: @sect2{error| @title{Error Handling}
fr_fr: @sect2{error| @title{Gestion des erreurs}

source: Because Lua is an embedded extension language, all Lua actions start from @N{C code} in the host program calling a function from the Lua library. (When you use Lua standalone, the @id{lua} application is the host program.) Whenever an error occurs during the compilation or execution of a Lua chunk, control returns to the host, which can take appropriate measures (such as printing an error message).
fr_fr: Parce que Lua est un langage d'extension embarqué, toutes les actions Lua commencent à partir de @N{code C} dans le programme hôte appelant une fonction de la bibliothèque Lua. (Lorsque vous utilisez Lua en mode autonome, l'application @id{lua} est le programme hôte.) Chaque fois qu'une erreur survient pendant la compilation ou l'exécution d'un morceau de Lua, le contrôle revient à l'hôte, qui peut prendre des mesures appropriées (comme l'impression d'un message d'erreur).

source: Lua code can explicitly generate an error by calling the @Lid{error} function. If you need to catch errors in Lua, you can use @Lid{pcall} or @Lid{xpcall} to call a given function in @emphx{protected mode}.
fr_fr: Le code Lua peut générer explicitement une erreur en appelant la fonction @Lid{error}. Si vous devez capturer des erreurs en Lua, vous pouvez utiliser @Lid{pcall} ou @Lid{xpcall} pour appeler une fonction donnée dans le @emphx{mode protégé}.

source: Whenever there is an error, an @def{error object} (also called an @def{error message}) is propagated with information about the error. Lua itself only generates errors whose error object is a string, but programs may generate errors with any value as the error object. It is up to the Lua program or its host to handle such error objects.
fr_fr: Chaque fois qu'il y a une erreur, un @def{objet d'erreur} (également appelé @def{message d'erreur}) se propage avec des informations sur l'erreur. Lua lui même génère seulement des erreurs dont l'objet est une chaîne, mais les programmes peuvent générer des erreurs avec n'importe quelle valeur comme objet d'erreur. C'est au programme Lua ou à son hôte de gérer de tels objets d'erreur.
